In [3]:
import pandas as pd
df=pd.read_csv('new.csv')
print(df)

       Name   Age      Place   Salary  emptycolumn
0   kingini  20.0     kannur  20000.0          NaN
1     tuttu  23.0    calicut  45000.0          NaN
2    chinnu  23.0  kolathara  25000.0          NaN
3     dhamu  23.0    calicut  15000.0          NaN
4      ikka  24.0    calicut  45000.0          NaN
5      Angu  24.0    calicut  54000.0          NaN
6  Kuttappi  23.0    calicut  61000.0          NaN
7       NaN   NaN        NaN      NaN          NaN

In [4]:
df_cleaned_row=df.dropna(how='all')
print(df_cleaned_row)

       Name   Age      Place   Salary  emptycolumn
0   kingini  20.0     kannur  20000.0          NaN
1     tuttu  23.0    calicut  45000.0          NaN
2    chinnu  23.0  kolathara  25000.0          NaN
3     dhamu  23.0    calicut  15000.0          NaN
4      ikka  24.0    calicut  45000.0          NaN
5      Angu  24.0    calicut  54000.0          NaN
6  Kuttappi  23.0    calicut  61000.0          NaN

In [5]:
df_cleaned_col = df.dropna(axis=1, how='all')
print(df_cleaned_col)

       Name   Age      Place   Salary
0   kingini  20.0     kannur  20000.0
1     tuttu  23.0    calicut  45000.0
2    chinnu  23.0  kolathara  25000.0
3     dhamu  23.0    calicut  15000.0
4      ikka  24.0    calicut  45000.0
5      Angu  24.0    calicut  54000.0
6  Kuttappi  23.0    calicut  61000.0
7       NaN   NaN        NaN      NaN

In [6]:
df_filled_data=df.fillna(0)
print(df_filled_data)

       Name   Age      Place   Salary  emptycolumn
0   kingini  20.0     kannur  20000.0          0.0
1     tuttu  23.0    calicut  45000.0          0.0
2    chinnu  23.0  kolathara  25000.0          0.0
3     dhamu  23.0    calicut  15000.0          0.0
4      ikka  24.0    calicut  45000.0          0.0
5      Angu  24.0    calicut  54000.0          0.0
6  Kuttappi  23.0    calicut  61000.0          0.0
7         0   0.0          0      0.0          0.0